[
  {
    "id": "project-1",
    "title": "AI-Powered Code Review Agent",
    "category": "GenAI & DevOps",
    "image": "/placeholder.svg?height=300&width=500",
    "blurb": "Led research and rollout of AI merge request review agent with 82% time reduction",
    "description": "Led the complete lifecycle of an AI-powered merge request review agent, from research and testing to production rollout. Partnered cross-functionally with engineering and DevOps teams to integrate the solution into the CI pipeline. Achieved remarkable results with 82% reduction in time to approve and 24% reduction in cycle time, significantly improving developer productivity.",
    "tech": "GenAI, CI/CD, DevOps, Ruby on Rails",
    "externalLink": "https://solverscorner.com/ai-code-review"
  },
  {
    "id": "project-2",
    "title": "High-Volume Service Architecture",
    "category": "Backend Systems",
    "image": "/placeholder.svg?height=300&width=500",
    "blurb": "Developed critical services handling ~2000 requests per minute",
    "description": "Architected and developed mission-critical backend services capable of handling ~2000 requests per minute with high reliability and low latency. Implemented robust error handling, monitoring, and scaling strategies to ensure 99.9% uptime. Used modern containerization and orchestration technologies for deployment.",
    "tech": "Ruby on Rails, Docker, Kubernetes, Microservices",
    "externalLink": "https://solverscorner.com/high-volume-services"
  },
  {
    "id": "project-3",
    "title": "WebRTC Image Quality System",
    "category": "Computer Vision & WebRTC",
    "image": "/placeholder.svg?height=300&width=500",
    "blurb": "Architected image quality scoring system for vehicle damage assessment",
    "description": "Architected and led development of an innovative image quality scoring system integrated with WebRTC for capturing high-quality vehicle damage images. Created a reusable Node.js package with React components for WebRTC video capturing, currently used by multiple applications and receiving ~21 downloads per month.",
    "tech": "WebRTC, Computer Vision, Node.js, React",
    "externalLink": "https://npmjs.com/package/webrtc-components"
  },
  {
    "id": "project-4",
    "title": "Legacy System Migration",
    "category": "System Architecture",
    "image": "/placeholder.svg?height=300&width=500",
    "blurb": "Engineered migration from legacy systems to modern email service with GraphQL",
    "description": "Led the complex migration of legacy email systems to modern, scalable architecture. Implemented GraphQL to enhance API functionality and improve developer experience. Managed the transition without service interruption while improving performance and maintainability. Included comprehensive documentation and team training.",
    "tech": "GraphQL, System Migration, Java/Spring, React",
    "externalLink": "https://solverscorner.com/legacy-migration"
  }
]
